СРО_Копия/src/Documents/ЗначенияПСК/ЗначенияПСК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗначенияПСК</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтчета</name>
    <type>
      <types>EnumRef.ВидыОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияОтчетногоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>РазделыПСК</name>
    <attributes>
      <name>Раздел</name>
      <type>
        <types>CatalogRef.Разделы</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПСК</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредельноеЗначениеПСК</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеРаздела</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

СРО_Копия/src/InformationRegisters/СРО_НаименованияРазделовПоКодамДокументов/СРО_НаименованияРазделовПоКодамДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СРО_НаименованияРазделовПоКодамДокументов</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Раздел</name>
    <type>
      <types>CatalogRef.Разделы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодДокумента</name>
    <type>
      <types>EnumRef.КодДокумента</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

СРО_Копия/src/Enums/ВидыОтчетов/ВидыОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОтчетов</name>
  <enumValues>
    <name>Квартал1</name>
  </enumValues>
  <enumValues>
    <name>Квартал2</name>
  </enumValues>
  <enumValues>
    <name>Квартал3</name>
  </enumValues>
  <enumValues>
    <name>Годовой90Дней</name>
  </enumValues>
  <enumValues>
    <name>Годовой30Дней</name>
  </enumValues>
  <enumValues>
    <name>ДанныеНаДату</name>
  </enumValues>
  <enumValues>
    <name>НаНерегулярнойОснове</name>
    <comment>Для документа &quot;ОтчетОПерсональномСоставеКооператива&quot;</comment>
  </enumValues>
  <enumValues>
    <name>Годовой</name>
    <comment>Для документа &quot;ОтчетОПерсональномСоставеКооператива&quot;</comment>
  </enumValues>
</mdclass:Enum>

СРО_Копия/src/Enums/КодДокумента/КодДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КодДокумента</name>
  <enumValues>
    <name>ОКУД_0420820_21631</name>
  </enumValues>
  <enumValues>
    <name>ОКУД_0420820_21632</name>
  </enumValues>
  <enumValues>
    <name>ОКУД_0420820_21633</name>
  </enumValues>
  <enumValues>
    <name>ОКУД_0420820_21634</name>
  </enumValues>
  <enumValues>
    <name>ОКУД_0420820_2164</name>
  </enumValues>
  <enumValues>
    <name>ОКУД_0420820_21641</name>
  </enumValues>
  <enumValues>
    <name>ОКУД_0420820_21642</name>
  </enumValues>
  <enumValues>
    <name>ОКУД_0420820_21644</name>
  </enumValues>
  <enumValues>
    <name>ОКУД_0420820_2165</name>
  </enumValues>
  <enumValues>
    <name>ОКУД_0420821_21632</name>
  </enumValues>
  <enumValues>
    <name>ОКУД_0420821_21633</name>
  </enumValues>
  <enumValues>
    <name>ОКУД_0420821_21634</name>
  </enumValues>
  <enumValues>
    <name>ОКУД_0420821_21643</name>
  </enumValues>
  <enumValues>
    <name>ОКУД_0420821_2165</name>
  </enumValues>
  <enumValues>
    <name>КодНеОпределен</name>
  </enumValues>
  <enumValues>
    <name>БО_2163</name>
  </enumValues>
  <enumValues>
    <name>ОКУД0420001_2163</name>
  </enumValues>
  <enumValues>
    <name>ОКУД0420001_2164</name>
  </enumValues>
  <enumValues>
    <name>ОКУД0420001_21641</name>
  </enumValues>
  <enumValues>
    <name>ОКУД0420001_2165</name>
  </enumValues>
</mdclass:Enum>

СРО_Копия/src/Catalogs/Разделы/Разделы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Разделы</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>Раздел1</name>
      <description>Раздел 1</description>
    </items>
    <items>
      <name>Раздел10</name>
      <description>Раздел 10</description>
    </items>
    <items>
      <name>Раздел11</name>
      <description>Раздел 11</description>
    </items>
    <items>
      <name>Раздел12</name>
      <description>Раздел 12</description>
    </items>
    <items>
      <name>Раздел13</name>
      <description>Раздел 13</description>
    </items>
    <items>
      <name>Раздел2</name>
      <description>Раздел 2</description>
        </content>
          </content>
        </content>
        </content>
        </content>
        </content>
        </content>
        </content>
        </content>
      </content>
          </content>
          </content>
        </content>
        </content>
      </content>
          </content>
          </content>
        </content>
          </content>
          </content>
        </content>
          </content>
        </content>
      </content>
    </items>
    <items>
      <name>Раздел3</name>
      <description>Раздел 3</description>
      </content>
        </content>
      </content>
        </content>
      </content>
        </content>
      </content>
    </items>
    <items>
      <name>Раздел4</name>
      <description>Раздел 4</description>
      </content>
      </content>
      </content>
        </content>
      </content>
      </content>
      </content>
        </content>
        </content>
      </content>
        </content>
        </content>
          </content>
          </content>
          </content>
        </content>
      </content>
      </content>
        </content>
        </content>
          </content>
          </content>
          </content>
        </content>
      </content>
      </content>
        </content>
        </content>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
    </items>
    <items>
      <name>Раздел5</name>
      <description>Раздел 5</description>
      </content>
    </items>
    <items>
      <name>Раздел6</name>
      <description>Раздел 6</description>
      </content>
        </content>
        </content>
        </content>
        </content>
        </content>
      </content>
    </items>
    <items>
      <name>Раздел7</name>
      <description>Раздел 7</description>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
    </items>
    <items>
      <name>Раздел8</name>
      <description>Раздел 8</description>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
    </items>
    <items>
      <name>Раздел9</name>
      <description>Раздел 9</description>
      </content>
      </content>
      </content>
    </items>
  </predefined>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокСортировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодРаздела</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

СРО_Копия/src/Documents/ЗначенияПСК/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
процедура ОбновитьПредставлениеПериода()
	ДатаОкончанияОтчетногоПериода = Объект.ДатаОкончанияОтчетногоПериода;
	
	НачалоПериода = НачалоКвартала(ДатаОкончанияОтчетногоПериода);
	ОкончаниеПериода = КонецКвартала(ДатаОкончанияОтчетногоПериода);   		
			
	Элементы.ДекорацияПериод.Заголовок = ПредставлениеПериода(НачалоПериода, ОкончаниеПериода);    
	УстановитьВидОтчетаНаСервере();
		
КонецПроцедуры

&НаСервере
процедура УстановитьВидОтчетаНаСервере()
	ДатаОкончанияОтчетногоПериода = Объект.ДатаОкончанияОтчетногоПериода;
	Если ДатаОкончанияОтчетногоПериода = НачалоДня(КонецКвартала(Дата(Год(ДатаОкончанияОтчетногоПериода), 3, 30))) Тогда
		Объект.ВидОтчета = Перечисления.ВидыОтчетов.Квартал1;	
	ИначеЕсли ДатаОкончанияОтчетногоПериода = НачалоДня(КонецКвартала(Дата(Год(ДатаОкончанияОтчетногоПериода), 6, 30))) Тогда
		Объект.ВидОтчета = Перечисления.ВидыОтчетов.Квартал2;		
	ИначеЕсли ДатаОкончанияОтчетногоПериода = НачалоДня(КонецКвартала(Дата(Год(ДатаОкончанияОтчетногоПериода), 9, 30))) Тогда
		Объект.ВидОтчета = Перечисления.ВидыОтчетов.Квартал3;			
	ИначеЕсли ДатаОкончанияОтчетногоПериода = НачалоДня(КонецКвартала(Дата(Год(ДатаОкончанияОтчетногоПериода), 12, 31))) Тогда
		Объект.ВидОтчета = Перечисления.ВидыОтчетов.Годовой90Дней;		
	КонецЕсли;  	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииОтчетногоПериода(Режим)
	
	Знак = ?(Режим = "Увеличить", 1, -1);   	
	
	//Если ПериодОтчетаГодовой() Тогда
	//	КоличествоМесяцев = 12;
	//	Объект.ДатаОкончанияОтчетногоПериода =  КонецКвартала(ДобавитьМесяц(Объект.ДатаОкончанияОтчетногоПериода, КоличествоМесяцев * Знак));			
	//Иначе	
		КоличествоМесяцев = 3;				 
		Объект.ДатаОкончанияОтчетногоПериода =  КонецКвартала(ДобавитьМесяц(Объект.ДатаОкончанияОтчетногоПериода, КоличествоМесяцев * Знак));			
//	КонецЕсли;  	
	
	
	ОбновитьПредставлениеПериода();	 
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьПериод(Команда)
	ПриИзмененииОтчетногоПериода("Уменьшить");     
КонецПроцедуры


&НаКлиенте
Процедура УвеличитьПериод(Команда)
	ПриИзмененииОтчетногоПериода("Увеличить");    
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(Объект.ДатаОкончанияОтчетногоПериода) Тогда
		Объект.ДатаОкончанияОтчетногоПериода = КонецКвартала(ДобавитьМесяц(ТекущаяДата(), -3));
	КонецЕсли;
	
	ОбновитьПредставлениеПериода();

КонецПроцедуры


&НаСервере
Процедура ЗаполнитьТаблицуРазделовПСК()
	
	Объект.РазделыПСК.Очистить();
		
	Организация = Константы.ОсновнаяОрганизация.Получить();
	
	Запрос = Новый Запрос;
	
	
	Если НачалоДня(Объект.ДатаОкончанияОтчетногоПериода) >= Дата(2020, 6, 30) Тогда
		
		МассивКодовДокументов = Новый Массив;
		МассивКодовДокументов.Добавить(Перечисления.КодДокумента.ОКУД_0420820_21633);
		МассивКодовДокументов.Добавить(Перечисления.КодДокумента.ОКУД_0420820_21634);  
		
		Если НачалоДня(Объект.ДатаОкончанияОтчетногоПериода) >= Дата(2022, 3, 31) Тогда			
			МассивКодовДокументов.Добавить(Перечисления.КодДокумента.ОКУД_0420820_21641);  
		КонецЕсли;
		
		Если НачалоДня(Объект.ДатаОкончанияОтчетногоПериода) >= Дата(2022, 10, 1) Тогда			
			МассивКодовДокументов.Добавить(Перечисления.КодДокумента.ОКУД_0420820_21642);  
		КонецЕсли;
		
		Если НачалоДня(Объект.ДатаОкончанияОтчетногоПериода) >= Дата(2023,4, 1) Тогда			
			МассивКодовДокументов.Добавить(Перечисления.КодДокумента.ОКУД_0420820_21642);  
		КонецЕсли;


		
		Запрос.Текст = "ВЫБРАТЬ
		               |	Разделы.Ссылка КАК Ссылка,
		               |	Разделы.КодРаздела КАК Код,
		               |	СРО_НаименованияРазделовПоКодамДокументов.Значение КАК НаименованиеРаздела
		               |ИЗ
		               |	РегистрСведений.СРО_НаименованияРазделовПоКодамДокументов КАК СРО_НаименованияРазделовПоКодамДокументов
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Разделы КАК Разделы
		               |		ПО СРО_НаименованияРазделовПоКодамДокументов.Раздел = Разделы.Ссылка
		               |			И (СРО_НаименованияРазделовПоКодамДокументов.КодДокумента В (&МассивКодовДокументов))
		               |ГДЕ
		               |	Разделы.Ссылка В ИЕРАРХИИ(&Раздел5_6)
		               |	И Разделы.Ссылка <> &Раздел5_6
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Разделы.ПорядокСортировки";

		Запрос.УстановитьПараметр("Раздел5_6", Справочники.Разделы.Раздел5);
		Запрос.УстановитьПараметр("МассивКодовДокументов", МассивКодовДокументов);

		

	Иначе	
		// заполняем тьабличные строки
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	Разделы.Ссылка КАК Ссылка,
		               |	Разделы.КодРаздела КАК Код,
		               |	Разделы.Наименование КАК НаименованиеРаздела
		               |ИЗ
		               |	Справочник.Разделы КАК Разделы
		               |ГДЕ
		               |	Разделы.Ссылка В ИЕРАРХИИ(&Раздел5_6)
		               |	И Разделы.Ссылка <> &Раздел5_6
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Разделы.ПорядокСортировки";
		Запрос.УстановитьПараметр("Раздел5_6", Справочники.Разделы.Раздел6);
	КонецЕсли;
	
	Выборка = запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Объект.РазделыПСК.Добавить();
		НоваяСтрока.Код = СокрЛП(Выборка.Код);
		НоваяСтрока.Раздел = Выборка.Ссылка;
		
		НоваяСтрока.НаименованиеРаздела = Выборка.НаименованиеРаздела;
		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьТаблицуРазделовПСК();	 
КонецПроцедуры
